{
  "intents": [
    {
      "tag": "background",
      "patterns": [
        "when was RISA created?",
        "tell me a little bit history of RISA?",
        "what would you tell me about RISA?"
      ],
      "responses": [
        "Rwanda Information Society Authority “RISA” is a government institution established in 2017, governed by presidential order N° 077/01 of 09/12/2022.RISA derives from the former IT department of Rwanda Development Board, RDB. Currently, it is an affiliated institution to the Ministry of ICT and Innovation. RISA has been put in place to be at the forefront of all ICT projects’ implementation and streamline research, infrastructures and innovation within the ICT sector. Furthermore champions the implementation of Smart Rwanda Master Plan initiatives."
      ]
    },
    {
      "tag": "mandate",
      "patterns": [
        "what is the main objectives of RISA?",
        "what is the main task of RISA?",
        "what is RISA is striving for?"
      ],
      "responses": [
        "Rwanda Information Society Authority has the mandate of planning and coordinating the implementation of national ICT for Development Agenda. In this perspective, RISA, in partnership with stakeholders and partners work to digitize government services and ensure easy access by the citizens."
      ]
    },
    {
      "tag": "responsibilities",
      "patterns": [
        "what are the responsibilitiesof RISA?",
        "In details tell me the responsibilities of RISA?",
        "why does RISA exists?",
        "what are the plans of RISA?",
        "what are the main duties of RISA?"
      ],
      "responses": [
        "RISA has the following responsibilities:\n(a) to participate in initiating and implementing national Information and Communication Technologies policies and programs in order to fast-track socio-economic growth;\n(b) to implement strategies which expand the access and affordability of Information and Communication Technologies infrastructures and services;\n(c) to accelerate community development through mainstreaming Information and Communication Technologies in national socio-economic sectors;\n(d) to prepare and coordinate programs that increase the required skills in the field of Information and Communication Technology in order to achieve a knowledgebased economy;\n(e) to establish and strengthen innovation programs in Information and Communication Technology;\n(f) to coordinate the implementation of projects and digitization initiatives that deliver Information and Communication Technology services;\n(g) to cooperate and collaborate with national, regional and international institutions with a similar mission;\n(h) to coordinate national Information and Communication Technology procurement for commonly procured Information and Communication Technology goods and services;\n(i) to advise Government on all activities which can fast track the development of Information and Communication Technology;\n(j) to provide technical assistance related to Information and Communication Technology as needed in public institutions;\n(k) to promote use of public key Infrastructure based technology in order to ensure authenticity, data integrity, confidentiality and accountability,\n(l) to promote and enhance general Information and Communication Technology knowledge, sensitization and awareness and Emerging Technologies;\n(m) to establish necessary Information and Communication Technology guidelines and Blueprints based on national, regional and international principles and monitor their implementation;\n(n) to recruit and deploy Information and Communication Technology Staff in public organs;\n(o) to perform any other responsibility, which is not contrary to its mission, as may be assigned by law or by competent organs."
      ]
    },
    {
      "tag": "management team",
      "patterns": [
        "who is the ceo of RISA?",
        "who is the chief executif officer of RISA?",
        "tell me the structure of RISA?",
        "who lead RISA?",
        "what are the main departments in RISA?"
      ],
      "responses": [
        "Rwanda Information Society Authority is headed by the Chief Executive Officer and two deputies: Government Chief Information Officer and Government Chief Innovation Officer.\nChief Executive Officer: Innocent BAGAMBA MUHIZI\nGovernment Chief Information Officer: Josephine NYIRANZEYIMANA\nChief Innovation Officer: Antoine SEBERA\nChief financial officer: Jane BATETA"
      ]
    },
    {
      "tag": "parteners",
      "patterns": [
        "who are the parteners of RISA?"
      ],
      "responses": [
        "Some of the parterners\nMINICT You can use this link<a href =\"https://www.minict.gov.rw\" target=\"_blank\"> here</a> for more information\nNCSA You can use this link<a href =\"https://www.cyber.gov.rw\" target=\"_blank\"> here</a> for more information\nRURA You can use this link<a href =\"https://http://www.rura.rw\" target=\"_blank\"> here</a> for more information"
      ]
    },
    {
      "tag": "publication",
      "patterns": [
        "what are the publication of RISA?",
        "what are the reports of RISA?",
        "need documents of RISA?",
        "tell me the announcements from RISA?"
      ],
      "responses": [
        "You can use this link <a href =\"https://www.risa.rw/#publications\" target=\"_blank\">here</a> for more information"
      ]
    },
    {
      "tag": "functions",
      "patterns": [
        "what are the most functions of RISA?",
        "tell me current projects done by RISA?"
      ],
      "responses": [
        "You can use this link <a href =\"https://www.risa.rw/#whatwedo\" target=\"_blank\">here</a> for more information"
      ]
    },
    {
      "tag": "news",
      "patterns": [
        "need news related to RISA",
        "some hot news from RISA",
        "what's recent in RISA"
      ],
      "responses": [
        "You can use this link <a href =\"https://www.risa.rw/#media\" target=\"_blank\">here</a> for more information"
      ]
    },
    {
      "tag": "Address",
      "patterns": [
        "where RISA is located at?",
        "tell me the headquaters of RISA",
        "where is your office?",
        "where can we visit you?",
        "what is your email address?",
        "which street are you located at?",
        "what is your address?",
        "which district are you located?",
        "which sector can I find you in?",
        "helpline",
        "toolfree",
        "contact number"
      ],
      "responses": ["Email: info@risa.gov.rw\nPhone: 4046\nAddress: Telecom House 8 KG 7 St, Kacyiru, Kigali P.O. Box 6603 Kigali-Rwanda"]
    },
    {
      "tag": "Greetings",
      "patterns": [
        "Hello",
        "Hi",
        "Mukomere",
        "Good Morning",
        "Mambo"
      ],
      "responses": [
        "Hello am maguire, How can I help you?",
        "hello! how are you doing?",
        "hi, pleasure to be of service",
        "hi, how can I help you?"
      ]
    },
    {
      "tag": "Endings",
      "patterns": [
        "Thank you",
        "bye",
        "Murakoze",
        "Goodbye",
        "Asante"
      ],
      "responses": [
        "its a pleasure to be at your service!",
        "you are welcome!",
        "feel free to come again anytime please!",
        "Anytime!",
        "happy to help!"
      ]
    },
    {
      "tag": "jobs",
      "patterns": [
        "Any tender in RISA?",
        "what are the jobs opportunity available?",
        "need internship",
        "Any tender in RISA?",
        "any offered internships",
        "Guide me to careers"
      ],
      "responses": [
        "You can use this link <a href =\"http://risa.rw/index.php?id=24\" target=\"_blank\">here</a> for more information"
      ]
    },
    {
      "tag": "usefull",
      "patterns":[
        "what are the recommended usefull links?",
        "guide me to related links?"
      ],
      "responses":[
        "You can use this link <a href =\"https://risa.rw/footer-menu/useful-links/\" target=\"_blank\">here</a> for more information"
      ]
    },
    {
      "tag": "e-service",
      "patterns": [
        "where can I get digital certificate?",
        "Need a digital certificate",
        "what would you say about digital certificate?"
      ],
      "responses": [
        "You can use this link <a href =\"https://www.govca.rw/\" target=\"_blank\">here</a> for more information"
      ]
    },
    {
      "tag":"privacy",
      "patterns":[
        "what is the privacy policy of RISA?",
        "what is the terms of use of RISA?"
      ],
      "responses":[
        "You can use this link <a href =\"https://www.risa.rw/footer-menu/privacy-policy/\" target=\"_blank\">here</a> for more information"
      ]
    },
    {
      "tag":"guidelines",
      "patterns":[
        "what are the guidelines for ICT implementations in government institutions",
        "what are the instructions for ICT implementations?",
        "guide me user manual of ICT?"
      ],
      "responses":[
        "You can use this link <a href =\"https://www.risa.rw/footer-menu/guidelines/\" target=\"_blank\">here</a> for more information"
      ]
    }
  ]
}